argandas/STM32F746G-DISCO_TouchGFX_Demo-1/Core/Src/main.cpp
  /*Configure GPIO pins : ARDUINO_A4_Pin ARDUINO_A5_Pin ARDUINO_A1_Pin ARDUINO_A2_Pin 
                           ARDUINO_A3_Pin */
  GPIO_InitStruct.Pin = ARDUINO_A4_Pin|ARDUINO_A5_Pin|ARDUINO_A1_Pin|ARDUINO_A2_Pin 
                          |ARDUINO_A3_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOF, &GPIO_InitStruct);

  /*Configure GPIO pins : ULPI_STP_Pin ULPI_DIR_Pin */
  GPIO_InitStruct.Pin = ULPI_STP_Pin|ULPI_DIR_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pin : RMII_RXER_Pin */
  GPIO_InitStruct.Pin = RMII_RXER_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(RMII_RXER_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : ARDUINO_A0_Pin */
  GPIO_InitStruct.Pin = ARDUINO_A0_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(ARDUINO_A0_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : DCMI_HSYNC_Pin PA6 */
  GPIO_InitStruct.Pin = DCMI_HSYNC_Pin|GPIO_PIN_6;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Alternate = GPIO_AF13_DCMI;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pins : ULPI_CLK_Pin ULPI_D0_Pin */
  GPIO_InitStruct.Pin = ULPI_CLK_Pin|ULPI_D0_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pin : ARDUINO_PWM_D6_Pin */
  GPIO_InitStruct.Pin = ARDUINO_PWM_D6_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Alternate = GPIO_AF9_TIM12;
  HAL_GPIO_Init(ARDUINO_PWM_D6_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : ARDUINO_MISO_D12_Pin ARDUINO_MOSI_PWM_D11_Pin */
  GPIO_InitStruct.Pin = ARDUINO_MISO_D12_Pin|ARDUINO_MOSI_PWM_D11_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Alternate = GPIO_AF5_SPI2;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

}

#define CLI_LOGGER_MAX_MESSAGE_LENGTH (128)

void cli_dbg(const char* label, const char* fn, const char* fmt, ...)
{
  size_t xLength = 0;
  int32_t xLength2 = 0;
  va_list args;
  char * pcPrintString = NULL;

  /* The queue is created by xLoggingTaskInitialize().  Check
   * xLoggingTaskInitialize() has been called. */
  configASSERT(cliLoggerQueueHandle);

  /* Allocate a buffer to hold the log message. */
  pcPrintString = (char*)pvPortMalloc( CLI_LOGGER_MAX_MESSAGE_LENGTH );

  if( pcPrintString != NULL )
  {
    /* There are a variable number of parameters. */
    va_start( args, fmt );

    if( strcmp( fmt, "\n" ) != 0 )
    {
      const char * pcTaskName;
      const char * pcNoTask = "None";

      if( xTaskGetSchedulerState() != taskSCHEDULER_NOT_STARTED )
      {
          pcTaskName = pcTaskGetName( NULL );
      }
      else
      {
          pcTaskName = pcNoTask;
      }

      xLength = snprintf( pcPrintString, CLI_LOGGER_MAX_MESSAGE_LENGTH, "[%s] %s --> ", label, pcTaskName);
    }

    xLength2 = vsnprintf( pcPrintString + xLength, CLI_LOGGER_MAX_MESSAGE_LENGTH - xLength, fmt, args );

    if( xLength2 < 0 )
    {
        xLength2 = 0;
        pcPrintString[ xLength ] = '\0';
    }

    xLength += ( size_t ) xLength2;
    va_end( args );

    /* Only send the buffer to the logging task if it is not empty. */
    if( xLength > 0 )
    {
        /* Send the string to the logging task for IO. */
        if( xQueueSend( cliLoggerQueueHandle, &pcPrintString, 0 ) != pdPASS )
        {
            /* The buffer was not sent so must be freed again. */
            vPortFree( ( void * ) pcPrintString );
        }
    }
    else
    {
        /* The buffer was not sent, so it must be freed. */
        vPortFree( ( void * ) pcPrintString );
    }
  }
}

uint16_t cli_dump(const char* src, uint16_t len)
{
  if (xSemaphoreTake(cliBinarySemHandle, 0) == pdTRUE)
  {
    cli_write(src, len);
    xSemaphoreGive(cliBinarySemHandle);
  }
}

void vApplicationStackOverflowHook(xTaskHandle *pxTask, signed portCHAR *pcTaskName )
{
    DBG_RTOS(" ERROR: Stack overflow --> %s\r\n", pcTaskName);
}

uint16_t cli_write(const char* src, uint16_t len)
{
  const uint32_t ulTimeout = 3000UL;

  if ((src != NULL) && (len > 0))
  {
    HAL_UART_Transmit(&huart1, (uint8_t*)src, len, ulTimeout);
    // HAL_UART_Transmit(&huart6, (uint8_t*)src, len, 100);
  }

  return len;
}

#if 0
uint16_t cli_printf(const char* fmt, ...)
{
  uint16_t len = 0;
  va_list args;
  va_start(args, fmt);
  vsnprintf(cli_buff, sizeof(cli_buff), fmt, args);
  // tfp_vsnprintf(cli_buff, sizeof(cli_buff), fmt, args);
  len = cli_write(&cli_buff[0], strlen(cli_buff));
  va_end(args);    

  return len;
}
#endif

uint16_t cli_printf(const char * fmt, ...)
{
  size_t xLength = 0;
  va_list args;
  char * pcPrintString = NULL;

  /* The queue is created by xLoggingTaskInitialize().  Check
   * xLoggingTaskInitialize() has been called. */
  configASSERT(cliLoggerQueueHandle);

  /* Allocate a buffer to hold the log message. */
  pcPrintString = (char*)pvPortMalloc(CLI_LOGGER_MAX_MESSAGE_LENGTH);

  if(pcPrintString != NULL)
  {
    /* There are a variable number of parameters. */
    va_start( args, fmt );
    xLength = vsnprintf(pcPrintString, CLI_LOGGER_MAX_MESSAGE_LENGTH, fmt, args);
    va_end( args );

    /* Only send the buffer to the logging task if it is not empty. */
    if(xLength > 0)
    {
        /* Send the string to the logging task for IO. */
        if(xQueueSend(cliLoggerQueueHandle, &pcPrintString, 0) != pdPASS)
        {
            /* The buffer was not sent so must be freed again. */
            vPortFree( ( void * ) pcPrintString );
        }
    }
    else
    {
      /* The buffer was not sent, so it must be freed. */
      vPortFree((void*)pcPrintString);
    }
  }

  return xLength;
}

