argandas/STM32F746G-DISCO_TouchGFX_Demo-1/Core/Src/main.cpp
  ip4_addr_t remote_ip; 
  BaseType_t xStatus = pdFALSE;
  err_t err;
  
  /* Temp Buffer PV */
  char* temp_buf_data = NULL;
  uint16_t temp_buf_data_len = 0;
  
  /* JSON PV */
  const char* json_data_fmt = "{\"api_key\": \"%s\", \"delta_t\": %d, \"field1\": %d}";
  uint8_t json_data[128];
  uint8_t json_data_len[4];
  
  /* Thingspeak server PV */
  const char* key = "WTN6FH385TCUNDMU";
  const char* server = "api.thingspeak.com";
  const char* url = "/update.json?headers=false";

  DBG_LWIP("POST data: %d\r\n",  data);

  if (DHCP_state == DHCP_ADDRESS_ASSIGNED)
  {
    /* Parse HTTP Body in JSON format */
    sprintf((char *)json_data, json_data_fmt, key, 5, data);  
    len = strlen((char *)json_data);
    sprintf((char *)json_data_len, "%d", len);  
          
    /* Build HTTP Request */
    lwhttp_request_put_request_line(req_ptr, LwHHTP_POST, url);
    lwhttp_request_put_message_header(req_ptr, "Content-Type", "application/json");
    lwhttp_request_put_message_header(req_ptr, "Content-Length", (char *)json_data_len);
    lwhttp_request_put_message_body(req_ptr, (char*)json_data, strlen((char *)json_data));  
          
    DBG_LWIP("JSON Data Sent: %d bytes\r\n%s\r\n", len, json_data);

    /* Run LwHTTP Request Parser */
    lwhttp_request_parse(req_ptr);

    /* Print the request */
    // http_print_msg(req_ptr);

    /* LwIP Connect TCP */
    conn = netconn_new(NETCONN_TCP);       
    if (NULL != conn)
    {
#if 0
      /* Bind a netconn to a specific local IP address and port (optional) */
      err = netconn_bind(conn, &netif->ip_addr, 60);
      if (err != ERR_OK)
      {
        cli_printf("[LwIP] %s --> netconn_bind (ERR = %d)\r\n", err);
      }
      else
#endif
      {
        err  = netconn_gethostbyname(server, &remote_ip);
        if (ERR_OK == err)
        {
          DBG_LWIP("HOST: %s (%s)\r\n", server, ip4addr_ntoa((const ip4_addr_t *)&remote_ip));
          
          /* Connect to server */
          err = netconn_connect(conn, &remote_ip, 80); 
          if (ERR_OK == err)
          {
            DBG_LWIP("netconn_connect: OK\r\n");

            /* Get LwHTTP Request Data */
            lwhttp_request_get(req_ptr, &temp_buf_data, &temp_buf_data_len);

            /* Write data to server */
            err = netconn_write(conn, temp_buf_data, temp_buf_data_len, NETCONN_NOFLAG);
            if (ERR_OK == err)
            {
              // DBG_LWIP("netconn_write (%d bytes)\r\n",  temp_buf_data_len);
              // DBG_RTOS("xPortGetFreeHeapSize = %d\r\n", xPortGetFreeHeapSize());

              /* Get pointer to buffer where response data is stored */
              uint8_t state = 0;
              int8_t nxt_rsp = 0;
              BaseType_t finished = pdFALSE;

              for(err = ERR_OK; (err == ERR_OK) && (finished == pdFALSE);)
              {
                switch (state)
                {
                  case 0:
                    {
                      err = netconn_recv(conn, &buf);
                      DBG_LWIP("switch --> netconn_recv (err = %d)\r\n", err);
                      // DBG_RTOS("xPortGetFreeHeapSize = %d\r\n", xPortGetFreeHeapSize());
                      if (err == ERR_OK)
                      {
                        state++;
                      }
                    }
                    break;
                  case 1:
                    {
                      nxt_rsp = netbuf_next(buf);
                      DBG_LWIP("switch --> netbuf_next (nxt_rsp = %d)\r\n", nxt_rsp);
                      // DBG_RTOS("xPortGetFreeHeapSize = %d\r\n", xPortGetFreeHeapSize());

                      /* Moved to the next part */
                      if(nxt_rsp >= 0)
                      {
                        err = ERR_OK;
                      }
                      /* There is no next part */
                      else
                      {
                        finished = pdTRUE;
                      }
                    }
                    break;
                  default:
                  break;
                }

                if ((err == ERR_OK) && (finished == pdFALSE))
                {
                    /* Get pointer to data and length*/
                    netbuf_data(buf, (void**)&temp_buf_data, &temp_buf_data_len);
                    
                    /* LwHTTP write response to parser */
                    lwhttp_response_put(rsp_ptr, (char*)temp_buf_data, temp_buf_data_len);
                }
              }

              if(state > 0)
              {
                /* Free data buffer */
                netbuf_delete(buf);
              }
              else
              {
                DBG_LWIP("netbuf not allocated (err = %d)\r\n", err);
              }
              
              if ((ERR_OK == err) || (err == ERR_CLSD))
              {
                /* Run LwHTTP Request Parser */
                lwhttp_response_parse(rsp_ptr);

                DBG_LWIP("netconn_recv (%d bytes)\r\n",  rsp_ptr->buffer.len);

                /* If parsed response contains the status line and the body we are OK*/
                if ((rsp_ptr->start_line.status_line.buffer.data != NULL) 
                  && (rsp_ptr->message_body.data != NULL))
                {                  
                  xStatus = pdTRUE;               
                }
              }
              else
              {
                DBG_LWIP("netconn_recv (err = %d)\r\n", err);
              }
            }
            else
            {
              DBG_LWIP("netconn_write (err = %d)\r\n", err);
            }
          }
          else
          {
            DBG_LWIP("netconn_connect (err = %d)\r\n", err);
          }
        }
        else
        {
          DBG_LWIP("netconn_gethostbyname (err = %d)\r\n", err);
        }
      }
      
      netconn_delete(conn);
    }
    else
    {
      err = ERR_CONN;
      DBG_LWIP("netconn_new (err = %d)\r\n", err);
    }    
  }
  else
  {
    DBG_DHCP("Unable to send TCP (DHCP State = %d)\r\n", DHCP_state);
  }

  return xStatus;
}

