argandas/STM32F746G-DISCO_TouchGFX_Demo-1/Core/Src/main.cpp
void Start_CLI_Logger_Task(void const * argument)
{
  /* USER CODE BEGIN Start_CLI_Logger_Task */
  char * pcReceivedString = NULL;

  /* Infinite loop */
  for(;;)
  {
    if(xQueueReceive(cliLoggerQueueHandle, &pcReceivedString, portMAX_DELAY) == pdPASS)
    {
      if (xSemaphoreTake(cliBinarySemHandle, portMAX_DELAY) == pdTRUE)
      {
        cli_write(pcReceivedString, strlen(pcReceivedString));
        xSemaphoreGive(cliBinarySemHandle);
      }
      vPortFree((void*)pcReceivedString);
    }
  }
  /* USER CODE END Start_CLI_Logger_Task */
}

void http_print_msg(lwhttp_message_t* msg)
{
  /* Temp Buffer PV */
  const char* line = "----------------------------";
  cli_printf("%s", line);
  cli_write(msg->buffer.data, msg->buffer.len);
  cli_printf("%s", line);
}

void Start_HTTP_Client_Task(void const * argument)
{
  /* USER CODE BEGIN Start_HTTP_Client_Task */
  RTOS_TASK_START();  
  
  /* Queue PV */
  uint8_t queueData = 0;
  lwhttp_message_header_t* content_type_header_ptr;

  static lwhttp_request_t client_request;
  static lwhttp_response_t client_response;

  /* Wait for DHCP */
  while (DHCP_state != DHCP_ADDRESS_ASSIGNED)
  {
    // DBG_LWIP("Waiting for DHCP (state = %d)\r\n",  DHCP_state);
    osDelay(10);
  }

  RTOS_TASK_READY();

  DBG_RTOS("xPortGetFreeHeapSize = %d\r\n", xPortGetFreeHeapSize());
  
  /* Infinite loop */
  for(;;)
  {
    if(xQueueReceive(tcpQueueHandle, &queueData, 0) == pdTRUE)
    {
      DBG_QUEUE("tcpQueueHandle: %d\r\n", queueData);

      /* LwHTTP Inits */
      lwhttp_request_init(&client_request);
      lwhttp_response_init(&client_response);  

      /* Sen POST request */
      if (pdTRUE == post_thingspeak(&client_request, &client_response, queueData))
      {
        // http_print_msg(&client_response);

        /* If HTTP Status Code is OK (200) and Content-Type is JSON */
        if ((0 == strncmp(client_response.start_line.status_line.status_code.data, "200", strlen("200"))) 
            && (0 == strncmp(content_type_header_ptr->field_value.data, "application/json", strlen("application/json")))
            && (1 < client_response.message_body.len))
        {
          DBG_LWIP("Valid response\r\n");
          /* Parse LwHTTP Response message body as JSON */   
          if (parse_thingspeak_rsp(client_response.message_body.data, client_response.message_body.len) == pdTRUE)
          {
            DBG_LWIP("Request FINISHED\r\n");
          }
        }   
        else
        {
          DBG_LWIP("Invalid response\r\n");
        }
      }
      else
      {
        DBG_LWIP("Failed to POST\r\n");
      }

      /* Free LwHTTP Request & Response */
      lwhttp_request_free(&client_request);
      lwhttp_response_free(&client_response);    
    }
    else
    {
      osDelay(10);  
    }
  }    
  /* USER CODE END Start_HTTP_Client_Task */
}

void Start_HTTP_Server_Task(void const * argument)
{
  RTOS_TASK_START();  

  /* USER CODE BEGIN Start_HTTP_Server_Task */
  static lwhttp_request_t server_request;
  static lwhttp_response_t server_response;
  
  static uint8_t server_response_buffer[64];
  
  UINT bytes_read = 0;
  FRESULT fr;
  FILINFO fno;

  /* LwIP PV */
  struct netconn *conn, *newconn;
  struct netbuf *netbuf = NULL;
  err_t err, accept_err;
  
  /* Temp Buffer PV */
  char* temp_buf_data = NULL;
  uint16_t temp_buf_data_len = 0;
  
  const char* hello_world = "Hello World!"; 
  
  uint8_t content_length[6];
  
  /* Wait for DHCP */
  while (DHCP_state != DHCP_ADDRESS_ASSIGNED)
  {
    // DBG_LWIP("Waiting for DHCP (state = %d)\r\n", DHCP_state);
    osDelay(10);
  }
  
  RTOS_TASK_READY();

  /* Create a new TCP connection handle */
  conn = netconn_new(NETCONN_TCP);
  if (conn!= NULL)
  {
    /* Bind to port 80 (HTTP) with default IP address */
    err = netconn_bind(conn, NULL, 80);
    
    if (err == ERR_OK)
    {
      /* Put the connection into LISTEN state */
      netconn_listen(conn);
  
      /* Infinite loop */
      for(;;)
      {
        /* accept any icoming connection */
        accept_err = netconn_accept(conn, &newconn);
        if(accept_err == ERR_OK)
        {
          /* LwHTTP Inits */
          lwhttp_request_init(&server_request);
          lwhttp_response_init(&server_response);  

#if 0
          /* Get pointer to buffer where response data is stored */
          for (err = ERR_OK; err == ERR_OK;)
#endif
          {
            /* Note: if this is executed 2 times it blocks the execution */
            err = netconn_recv(newconn, &netbuf);
            if (err != ERR_OK)
            {
              DBG_LWIP("netconn_recv (err = %d)\r\n", err);
            }
            else
            {
              err = netconn_err(newconn);
              if (err != ERR_OK) 
              {
                DBG_LWIP("netconn_err (err = %d)\r\n", err);
              }
              else
              {
                do
                {                  
                  /* Get pointer to data and length*/
                  err = netbuf_data(netbuf, (void**)&temp_buf_data, &temp_buf_data_len);
                  if (err != ERR_OK) 
                  {
                    DBG_LWIP("netbuf_data (err = %d)\r\n", err);
                  }
                  else
                  {
                    /* LwHTTP write request to parser */
                    lwhttp_request_put(&server_request, (char*)temp_buf_data, temp_buf_data_len);
                  }                  
                }
                while (netbuf_next(netbuf) >= 0);
                
                /* Free data buffer */
                netbuf_delete(netbuf);       
              }
            }
          }

          /* Parse HTTP Request */
          lwhttp_request_parse(&server_request);
          
          /* If HTTP Status Code is OK (200) and Content-Type is JSON */
          if ((0 == strncmp(server_request.start_line.request_line.method.data, "GET", strlen("GET"))) 
              && (0 == strncmp(server_request.start_line.request_line.request_uri.data, "/", strlen("/")))
              && (server_request.start_line.request_line.request_uri.len == strlen("/")))
          {
            /* Get content length */
            sprintf((char *)content_length, "%d", strlen((char *)hello_world));  

            /* Build HTTP Response */
            lwhttp_response_put_status_line(&server_response, "200", "OK");
            lwhttp_response_put_message_header(&server_response, "Content-Type", "text/html");
            lwhttp_response_put_message_header(&server_response, "Content-Length", (char*)content_length);
            lwhttp_response_put_message_body(&server_response, hello_world, strlen(hello_world));     
            
            /* Send Response */
            lwhttp_response_get(&server_response, &temp_buf_data, &temp_buf_data_len);
            netconn_write(newconn, temp_buf_data, temp_buf_data_len, NETCONN_COPY);   
          }
          else if ((0 == strncmp(server_request.start_line.request_line.method.data, "GET", strlen("GET"))) 
              && (0 == strncmp(server_request.start_line.request_line.request_uri.data, "/index.html", strlen("/index.html")))
              && (server_request.start_line.request_line.request_uri.len == strlen("/index.html")))
          {
            /* Get content length */
            f_stat("index.htm", &fno);
            sprintf((char *)content_length, "%d", fno.fsize);  

            /* Build HTTP Response */
            lwhttp_response_put_status_line(&server_response, "200", "OK");
            lwhttp_response_put_message_header(&server_response, "Content-Type", "text/html");
            lwhttp_response_put_message_header(&server_response, "Content-Length", (char*)content_length);
            lwhttp_response_put_eol(&server_response);     
            
            /* Send Response Start-Line + Message-Headers + <CR><LF> */
            lwhttp_response_get(&server_response, &temp_buf_data, &temp_buf_data_len);
            netconn_write(newconn, temp_buf_data, temp_buf_data_len, NETCONN_COPY);
            
            /* Send Response Body-Message */
            bytes_read = sizeof(server_response_buffer);
            for(UINT idx = 0; bytes_read >= sizeof(server_response_buffer);idx++)
            {
              fr = read_file_sector(&HTTP_File, (void*)server_response_buffer, sizeof(server_response_buffer), &bytes_read, idx);
              if (FR_OK != fr)
              {
                DBG_FATFS("read_file_sector (fr = %d)\r\n",  fr);
                bytes_read = 0;
              }
              else
              {
                netconn_write(newconn, &server_response_buffer[0], bytes_read, NETCONN_COPY);
              }
            }
          }
          else
          {
            /* Build HTTP Response */
            lwhttp_response_put_status_line(&server_response, "404", "NOT FOUND");
            lwhttp_response_put_message_header(&server_response, "Content-Type", "text/html");
            lwhttp_response_put_message_header(&server_response, "Content-Length", "0");
            lwhttp_response_put_message_body(&server_response, NULL, 0);             
            
            /* Send Response */
            lwhttp_response_get(&server_response, &temp_buf_data, &temp_buf_data_len);
            netconn_write(newconn, temp_buf_data, temp_buf_data_len, NETCONN_COPY);   
          }
          
