argandas/STM32F746G-DISCO_TouchGFX_Demo-1/Core/Src/main.cpp
  /* Infinite loop */
  for(;;)
  {
    if (state != state_new)
    {
      DBG_FATFS("State transition (%d >> %d)\r\n", state, state_new);
      state = state_new;
    }

    switch(state){
      case 0:
      {
        /*##-1- Link the micro SD disk I/O driver ##################################*/
        ret = BSP_SD_Init();
        if(ret == MSD_OK)
        {
          /*##-2- Register the file system object to the FatFs module ##############*/
          fr = f_mount(fs, (TCHAR const*)SDPath, 0);
          if(fr != FR_OK)
          {
            DBG_FATFS("f_mount (fr = %d)\r\n",  fr);
          }
          else
          {
            state_new = 1;
          }
        }
        else
        {
          DBG_FATFS("BSP_SD_Init (ret = %d)\r\n",  ret);
        }
      }
      break;
      case 1:
      {
        /* Get random number */
        HAL_RNG_GenerateRandomNumber(&hrng, &rng_value);

        /* Add to file */
        fr = sd_log((uint8_t)(rng_value % 10));
        if(fr != FR_OK)
        {
          state_new = 0;
        }
        else
        {
          state_new = 2;
        }
      }
      break;
      case 2:
      {
        if(xQueueReceive(logQueueHandle, &queueData, 0) == pdTRUE)
        {
          DBG_QUEUE("logQueueHandle: %d\r\n", queueData);
          fr = sd_log(queueData);
          if(fr != FR_OK)
          {
            state_new = 0;
          }
        }
        else if(xQueueReceive(dumpQueueHandle, &queueData, 0) == pdTRUE)
        {
          DBG_QUEUE("dumpQueueHandle\r\n");
          fr = sd_dump();
          if(fr != FR_OK)
          {
            state_new = 0;
          }
        }
      }
      break;
      default:
      break;
    }
    osDelay(10);
  }

  /* USER CODE END StartSDTask */
}

/* USER CODE BEGIN Header_StartLWIPTask */
/**
* @brief Function implementing the lwipTask thread.
* @param argument: Not used
* @retval None
*/

void setDHCP_State(uint8_t state)
{
  DBG_DHCP("DHCP State change (%d >> %d)\r\n", DHCP_state, state);
  DHCP_state = state;
}

void StartLWIPTask(void const * argument)
{
  RTOS_TASK_START();  

  /* USER CODE BEGIN StartLWIPTask */
  /* LwIP PV */
  struct netif* netif = (struct netif*)argument;
  ip_addr_t ipaddr;
  ip_addr_t netmask;
  ip_addr_t gw;
  struct dhcp *dhcp;

  uint8_t queueData = 0;

  /* init code for LWIP */
  MX_LWIP_Init();

  RTOS_TASK_READY();

  /* Infinite loop */
  for(;;)
  {
    switch (DHCP_state)
    {
    case DHCP_OFF:
      {
        /* Check interface status */
        if (netif_is_up(netif))
        {
          setDHCP_State(DHCP_START);
        }
      }
      break;
    case DHCP_START:
      {
        ip_addr_set_zero_ip4(&netif->ip_addr);
        ip_addr_set_zero_ip4(&netif->netmask);
        ip_addr_set_zero_ip4(&netif->gw);       
        dhcp_start(netif);
        setDHCP_State(DHCP_WAIT_ADDRESS);
        DBG_DHCP("Looking for server\r\n");
      }
      break;
    case DHCP_WAIT_ADDRESS:
      {                
        if (dhcp_supplied_address(netif)) 
        {
          setDHCP_State(DHCP_ADDRESS_ASSIGNED); 
          DBG_DHCP("Dynamic IP address (%s)\r\n", ip4addr_ntoa((const ip4_addr_t *)&netif->ip_addr));
        }
        else
        {
          dhcp = (struct dhcp *)netif_get_client_data(netif, LWIP_NETIF_CLIENT_DATA_INDEX_DHCP);
    
          /* DHCP timeout */
          if (dhcp->tries > MAX_DHCP_TRIES)
          {
            setDHCP_State(DHCP_TIMEOUT);
            
            /* Stop DHCP */
            dhcp_stop(netif);
            
            /* Static address used */
            IP_ADDR4(&ipaddr, IP_ADDR0 ,IP_ADDR1 , IP_ADDR2 , IP_ADDR3 );
            IP_ADDR4(&netmask, NETMASK_ADDR0, NETMASK_ADDR1, NETMASK_ADDR2, NETMASK_ADDR3);
            IP_ADDR4(&gw, GW_ADDR0, GW_ADDR1, GW_ADDR2, GW_ADDR3);
            netif_set_addr(netif, ip_2_ip4(&ipaddr), ip_2_ip4(&netmask), ip_2_ip4(&gw));
            
            DBG_DHCP("Timeout\r\n");
            DBG_DHCP("Static IP address (%s)\r\n", ip4addr_ntoa((const ip4_addr_t *)&netif->ip_addr));
          }
        }
      }
      break;
    case DHCP_LINK_DOWN:
      {
        /* Stop DHCP */
        dhcp_stop(netif);
        setDHCP_State(DHCP_OFF); 
      }
      break;
    case DHCP_ADDRESS_ASSIGNED:
      {
        if(xQueueReceive(getIPQueueHandle, &queueData, 0) == pdTRUE)
        {
          DBG_QUEUE("getIPQueueHandle\r\n");

          strcpy(ip4_addr_ptr, ip4addr_ntoa((const ip4_addr_t *)&netif->ip_addr));

          if(xQueueSend(setIPQueueHandle, &ip4_addr_ptr, 0) == pdTRUE)
          {
              DBG_QUEUE("setIPQueueHandle = %s\r\n", ip4_addr_ptr);
          }
        }
      }
      break;
    default: 
      break;
    }
      
      /* wait 100 ms */
      osDelay(10);
  }
  /* USER CODE END StartLWIPTask */
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
    /* User can add his own implementation to report the HAL error return state */

  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
    /* User can add his own implementation to report the file name and line number,
       tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
